# 日本語のエンコード（理解する必要はなし）
import io
import sys
sys.stdout = io.TextIOWrapper(sys.stdout.buffer, encoding='utf-8')

# 手順１１の作成範囲--------------------------------------------------


# 手順１２の作成範囲----------------------------------------------


# 手順１３の作成範囲--------------------------------------------------


# 手順１４の作成範囲--------------------------------------------------

	# x の中からランダムにデータ番号を取得
	batch_mask = np.random.choice(x.shape[0],batch_size)
	

	# 手順１５の作成範囲----------------------------------------------
	

	b1 = list(net.params['b1'])
	print(str(i) + "回目の反復です。今回のb1は " + str(b1[0]))





